app/controllers/byob_controller.rb

  def index
    #save the users email address and name in the DB

    user_email_perm = params[:fb_sig_user_email_perm][2..-3]
    user_info = params[:fb_sig_user_info][2..-3].split(",")
    user_info.collect!{ |x| x.delete!("\"") }
    @current_user.email_revoked = ((user_email_perm.eql? "1") && true) || false
    @current_user.email = user_info[0]
    @current_user.name = user_info[1]
    @current_user.save
---
INSERT INTO "users" ("session_key", "updated_at", "facebook_id", "created_at") VALUES(NULL, '2009-11-07 22:08:33', 1917261, '2009-11-07 22:08:33')