app/controllers/rides_controller.rb

  def join
    @ride = Ride.find(params[:id], :include => [:driver, :riders, :watchers])

    seats_available = (@ride.seats_total - @ride.seats_filled) > 0

    if (seats_available)
      @ride.seats_filled += 1
      @ride.riders << @current_user
      if @ride.watchers.exists?(@current_user)
        @ride.watchers.delete(@current_user)
      end
      @ride.save
---
INSERT INTO "drivers" ("updated_at", "user_id", "created_at") VALUES('2009-11-08 03:13:48', NULL, '2009-11-08 03:13:48')
UPDATE "drivers" SET "updated_at" = '2009-11-08 03:13:48', "user_id" = 57 WHERE "id" = 56