app/controllers/rides_controller.rb

  def index
    @rides = Ride.all
    @rides_from_campus = Ride.find(:all, :conditions => { :tocampus => false})
---
SELECT * FROM "rides"
SELECT * FROM "rides" WHERE ("rides"."tocampus" = 'f')

  def show
    @publish_ride_joined = session[:publish_ride_joined]
    @publish_ride_created = session[:publish_ride_created]
    session[:publish_ride_joined] = nil
    session[:publish_ride_created] = nil

    @ride = Ride.find(params[:id])

    @driver = @ride.driver.user
    @driver_fb = Facebooker::User.new(@driver.facebook_id.to_s)
    @driver_info = {"name" => @driver_fb.name,
    "pic" => @driver_fb.pic_square,
    "profile_url" => @driver_fb.profile_url}

    @passengers_info = @ride.passengers.collect do |x|
---
SELECT * FROM "rides" WHERE ("rides"."id" = 0)
SELECT "users".id FROM "users" WHERE ("users"."id" = 1917261) LIMIT 1
SELECT * FROM "drivers" WHERE ("drivers"."id" = 3)
SELECT * FROM "passengers" INNER JOIN "passengers_rides" ON "passengers".id = "passengers_rides".passenger_id WHERE ("passengers_rides".ride_id = 1 )

  def create
    @ride = Ride.new(params[:ride])
    @ride.driver = @current_user.driver

    @current_user_fb = facebook_session.user
    respond_to do |format|
      if @ride.save
---
INSERT INTO "drivers" ("updated_at", "user_id", "created_at") VALUES('2009-11-07 23:14:58', NULL, '2009-11-07 23:14:58')
INSERT INTO "rides" ("name", "driver_id", "updated_at", "pickup_datetime", "dropoff", "tocampus", "about", "dropoff_datetime", "pickup", "created_at") VALUES('Magic Carpet Ride', 3, '2009-11-07 20:20:30', NULL, 'Aladdin''s Castle ', 't', 'The genie''ll be there', NULL, 'Altgeld', '2009-11-07 20:20:30')
INSERT INTO "users" ("session_key", "updated_at", "facebook_id", "created_at") VALUES(NULL, '2009-11-07 23:14:58', 1917261, '2009-11-07 23:14:58')

  def join
    @ride = Ride.find(params[:id])
    @ride.passengers << @current_user.passenger

    respond_to do |format|
      if @ride.save
---
SELECT * FROM "rides" WHERE ("rides"."id" = 1)
INSERT INTO "passengers" ("updated_at", "user_id", "created_at") VALUES('2009-11-08 03:13:48', NULL, '2009-11-08 03:13:48')
INSERT INTO "users" ("session_key", "updated_at", "facebook_id", "created_at") VALUES(NULL, '2009-11-08 03:13:48', 1917261, '2009-11-08 03:13:48')
UPDATE "passengers" SET "updated_at" = '2009-11-08 03:13:48', "user_id" = 57 WHERE "id" = 56

  def destroy
    @ride = Ride.find(params[:id])
    @ride.destroy
---
SELECT * FROM "rides" WHERE ("rides"."id" = 2)
DELETE FROM "rides" WHERE "id" = 2