app/controllers/users_controller.rb

  def login
    @user = User.find(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" = 1)

  def index
    @users = User.all
---
SELECT * FROM "users"

  def show
    @user = User.find(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" = 1)

  def edit
    @user = User.find(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" = 1)

  def create
    @user = User.new(params[:user])

    @user.driver = Driver.create()
    @user.passenger = Passenger.create()
---
INSERT INTO "drivers" ("updated_at", "user_id", "created_at") VALUES('2009-11-07 05:57:43', NULL, '2009-11-07 05:57:43')
INSERT INTO "users" ("name", "updated_at", "phonenumber", "sex", "about", "email", "created_at") VALUES('Harish Tella', '2009-11-07 05:57:43', '55555555', 'male', 'something about me', 'something@foo.com', '2009-11-07 05:57:43')
INSERT INTO "passengers" ("updated_at", "user_id", "created_at") VALUES('2009-11-07 05:57:43', NULL, '2009-11-07 05:57:43')